In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv('./archive.zip',usecols=['Age','Survived'])
df

     Survived   Age
0           0  34.5
1           1  47.0
2           0  62.0
3           0  27.0
4           1  22.0
..        ...   ...
413         0   NaN
414         1  39.0
415         0  38.5
416         0   NaN
417         0   NaN

[418 rows x 2 columns]

In [3]:
x=df.drop(['Survived'],axis=1)
y=df['Survived']

In [4]:
x

      Age
0    34.5
1    47.0
2    62.0
3    27.0
4    22.0
..    ...
413   NaN
414  39.0
415  38.5
416   NaN
417   NaN

[418 rows x 1 columns]

In [5]:
y

0      0
1      1
2      0
3      0
4      1
      ..
413    0
414    1
415    0
416    0
417    0
Name: Survived, Length: 418, dtype: int64

In [6]:
from sklearn.model_selection import train_test_split

In [7]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.33, random_state=42)

In [8]:
len(x_train),len(y_train)

(280, 280)

In [9]:
len(y_test),len(y_test)

(138, 138)

In [10]:
x_train['Age_replaced']=np.where(x_train['Age'].isnull(),1,0)

In [11]:
x_train

      Age  Age_replaced
109  18.5             0
176  20.0             0
366   NaN             1
407  50.0             0
280  23.0             0
..    ...           ...
71   21.0             0
106  21.0             0
270  46.0             0
348  24.0             0
102   NaN             1

[280 rows x 2 columns]